stock-exchange-back-end/app/controllers/api/v1/userstocks_controller.rb

SELECT "userstocks".* FROM "userstocks"
---
  def index
    @userstocks = Userstock.all

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."name" = $1 LIMIT $2  [["name", "aa"], ["LIMIT", 1]]
INSERT INTO "stocks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "aa"], ["created_at", "2020-02-16 07:05:25.243271"], ["updated_at", "2020-02-16 07:05:25.243271"]]
INSERT INTO "stocks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "a"], ["created_at", "2020-02-17 20:24:24.079930"], ["updated_at", "2020-02-17 20:24:24.079930"]]
INSERT INTO "userstocks" ("stock_id", "user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stock_id", 1], ["user_id", 22], ["amount", 1], ["created_at", "2020-02-16 06:55:54.160726"], ["updated_at", "2020-02-16 06:55:54.160726"]]
UPDATE "users" SET "money" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["money", 4984], ["updated_at", "2020-02-16 06:55:54.271091"], ["id", 22]]
---
  def create

    stock_ticker = userstock_params["ticker"]
    amount = userstock_params["qty"]
    money = userstock_params["money"]
    @stock = Stock.find_by(name: stock_ticker)
    if !@stock
      @stock = Stock.create(name: stock_ticker)
    end
    Userstock.create(user_id:cur_user.id, stock_id: @stock.id, amount: amount)
    cur_user.update(money: money)

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "userstocks".* FROM "userstocks" WHERE "userstocks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def find_userstock
    @userstock = Userstock.find(params[:id])