stock-exchange-back-end/app/controllers/api/v1/users_controller.rb

  def update
    @user.update(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"