stock-exchange-back-end/app/controllers/api/v1/userstocks_controller.rb

  def find_userstock
    @userstock = Userstock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "userstocks".* FROM "userstocks" WHERE "userstocks"."user_id" = $1  [["user_id", 1]]